{
  "player": {
    "roomId": "outside",
    "inventory": [],
    "flags": {
      "hasStarted": false,
      "hasLight": true,
      "talkedToNPC": false,
      "foundQuarter": false
    }
  },
  "rooms": {
    "outside": {
      "id": "outside",
      "name": "Outside the Storefront",
      "description": "You stand on cracked pavement facing a narrow tech shop, its window crammed with retro hardware stacked like a memory puzzle. Neon tubes sputter in an amber halo, their letters warped by drizzle; you'll need to step closer if you want to read them. The air smells of petrichor and warm circuitry, and somewhere distant thunder practises its lines.\n\nSomething small glints near the doorway, half-hidden between tiles. You can duck IN to the shop, cross the STREET to the house, wander toward the TRAIN station, or follow the path to the COAST.",
      "exits": {
        "in": "store",
        "inside": "store",
        "street": "home",
        "train": "train_station",
        "coast": "coast_line"
      },
      "objects": ["quarter", "neon_signs", "metaphora_sign", "retro_devices"],
      "npcs": ["friendly_stranger"],
      "flags": {
        "visited": false,
        "stormWarningGiven": false
      }
    },
    "store": {
      "id": "store",
      "name": "Metaphora — Tech Shop",
      "description": "You slip inside and the door sighs behind you. Towers of CRTs and boxes of cables form aisles of controlled chaos, each stack humming like a contented cat. A workbench at the back hosts prototypes mid-thought: circuit boards, scribbled flowcharts, and a mug of coffee that has lost the heat but not the hope.\n\nThe room smells of solder and optimism. The only way OUT is the door you came through.",
      "exits": {
        "out": "outside",
        "outside": "outside",
        "back": "outside"
      },
      "objects": ["crt_stack", "workbench_notes", "prototype_console"],
      "flags": {
        "visited": false
      }
    },
    "home": {
      "id": "home",
      "name": "House Across the Street",
      "description": "The small house feels lived-in rather than staged. Shoes gather by the door, evidence of a family that leaves and returns in looping patterns. A hallway disappears inward, lined with photos that capture laughter mid-bloom. Somewhere deeper, a kettle cools after being forgotten in the excitement of an idea.\n\nIt's peaceful, full of unfinished sentences. The STREET is the way back.",
      "exits": {
        "street": "outside",
        "out": "outside",
        "outside": "outside",
        "back": "outside"
      },
      "objects": ["family_portrait", "toy_robot", "open_journal"],
      "flags": {
        "visited": false,
        "doorUnlocked": true
      }
    },
    "train_station": {
      "id": "train_station",
      "name": "The Train Station",
      "description": "The platform stretches farther than physics ought to allow. Fog curls around rusted rails that vanish into nothing, and a split-flap board clatters through destinations that cannot possibly exist. The wind tastes of static; announcements never quite make it to sound.\n\nTime feels elastic here. BACK to the storefront is the only option unless you fancy waiting forever.",
      "exits": {
        "storefront": "outside",
        "back": "outside",
        "out": "outside"
      },
      "objects": ["splitflap_board", "waiting_bench", "ghost_ticket"],
      "flags": {
        "visited": false,
        "trainExpected": false
      }
    },
    "coast_line": {
      "id": "coast_line",
      "name": "The Coast",
      "description": "The path opens onto a slate coast. Waves hammer the rocks with patient fury, each retreat leaving salt and ozone on your tongue. The horizon flickers between storm clouds and sunlit memories, as if the weather can't pick a mood.\n\nGulls wheel overhead, sounding suspiciously like laughter at your expense. The only clear path is BACK toward the storefront, unless you plan to walk into the sea and see what answers it has.",
      "exits": {
        "back": "outside",
        "storefront": "outside",
        "out": "outside"
      },
      "objects": ["tidal_pool", "storm_clouds", "driftwood_sign"],
      "flags": {
        "visited": false,
        "tidalPattern": "low"
      }
    }
  },
  "objects": {
    "quarter": {
      "id": "quarter",
      "name": "tarnished quarter",
      "aliases": ["quarter", "coin", "money"],
      "description": "A tarnished quarter from 1984, edges smoothed by anxious flipping. Someone scratched D.N. into the metal. It's warmer than it ought to be, as if memory retains its own heat.",
      "location": "room:outside",
      "portable": true,
      "onUse": "You flip the quarter. The neon catches it mid-spin, casting fleeting constellations across your palm. It lands with a soft clink and the storm somewhere overhead gives a polite rumble of approval."
    },
    "neon_signs": {
      "id": "neon_signs",
      "name": "neon signs",
      "aliases": ["signs", "neon", "lights"],
      "description": "Neon tubing frames the window. Up close you can make out letters stuttering between \"METAPHORA\" and simply \"METAPHOR\". The buzz is half warning, half welcome, like a thought you refuse to misplace.",
      "location": "room:outside",
      "portable": false
    },
    "metaphora_sign": {
      "id": "metaphora_sign",
      "name": "Metaphora plaque",
      "aliases": ["sign", "plaque", "metaphora", "store sign", "shop sign"],
      "description": "A brass plaque beside the door reads \"METAPHORA\" in patient lettering. Beneath it, engraved in smaller type: \"Where memory meets tomorrow.\" Tilt your head and the words seem to rearrange into \"Metaphor? Ah.\" The plaque pretends not to notice.",
      "location": "room:outside",
      "portable": false
    },
    "retro_devices": {
      "id": "retro_devices",
      "name": "retro devices",
      "aliases": ["devices", "tech", "equipment", "hardware"],
      "description": "Walkmen, pagers, and consoles crowd the window display, each frozen mid-fashionable moment. One Game Boy shows only a blank green stare until you blink, when for a heartbeat it displays a level layout you don't recognise.",
      "location": "room:outside",
      "portable": false
    },
    "crt_stack": {
      "id": "crt_stack",
      "name": "tower of CRTs",
      "aliases": ["crts", "monitors", "screens", "stack"],
      "description": "A precarious stack of CRT monitors loops footage of projects at various stages: a glitchy devlog, a half-rendered game scene, a keyboard bathed in midnight light. Occasionally the feeds sync and you catch your own reflection looking back.",
      "location": "room:store",
      "portable": false,
      "onUse": "You tap the top monitor. The stack shivers, resolves into a single line of green text: \"PROGRESS: IN PROGRESS.\" Then the screens return to their static gossip."
    },
    "workbench_notes": {
      "id": "workbench_notes",
      "name": "workbench notes",
      "aliases": ["notes", "stickies", "post-its", "list"],
      "description": "Sticky notes fan across the bench: \"edit next dev video\", \"ship the build before the storm\", \"call mum\", \"remember to sleep\". The handwriting grows wobblier toward the edge, like the writer ran out of daylight.",
      "location": "room:store",
      "portable": false
    },
    "prototype_console": {
      "id": "prototype_console",
      "name": "prototype console",
      "aliases": ["console", "prototype", "device", "handheld"],
      "description": "A half-built handheld wired to a breadboard. Its tiny screen shows a blinking cursor waiting for instruction, as if it expects you to type something profound or at least entertaining.",
      "location": "room:store",
      "portable": false,
      "onUse": "You press the lone button. The cursor blinks faster, then prints \"READY WHEN YOU ARE\" before fading back to anticipation."
    },
    "family_portrait": {
      "id": "family_portrait",
      "name": "family portrait",
      "aliases": ["portrait", "photo", "picture"],
      "description": "A framed photograph catches a family mid-laugh. Someone's eyes are squeezed shut, someone's hair is in motion, and the joy is wonderfully imperfect. A faint reflection shows storm clouds gathering beyond the window outside the frame.",
      "location": "room:home",
      "portable": false
    },
    "toy_robot": {
      "id": "toy_robot",
      "name": "toy robot",
      "aliases": ["robot", "toy", "figure"],
      "description": "A small 3D-printed robot sits on the shoe rack, one arm missing, LEDs blinking a stubborn heartbeat. Someone has scrawled \"beta\" on its back in permanent marker.",
      "location": "room:home",
      "portable": false
    },
    "open_journal": {
      "id": "open_journal",
      "name": "open journal",
      "aliases": ["journal", "notebook", "diary", "notes"],
      "description": "A notebook lies open on the hall table. One page holds a gratitude list; the next, a sketched level layout full of arrows and question marks. A tea ring smudges the ink like a quiet apology.",
      "location": "room:home",
      "portable": false
    },
    "splitflap_board": {
      "id": "splitflap_board",
      "name": "split-flap board",
      "aliases": ["board", "timetable", "schedule", "display"],
      "description": "The split-flap board rattles through impossible destinations: MEMORY LANE, NEXT BUILD, SOMEDAY, SOONISH. Every so often it pauses on a blank space, as if contemplating silence.",
      "location": "room:train_station",
      "portable": false,
      "onUse": "You press the service button. The flaps whir, then settle on: \"NEXT TRAIN: WHEN YOU STOP HESITATING.\" It immediately pretends it never said that."
    },
    "waiting_bench": {
      "id": "waiting_bench",
      "name": "waiting bench",
      "aliases": ["bench", "seat"],
      "description": "A wooden bench worn smooth by patient dreamers. Someone carved \"CATCH YOUR BREATH\" into the armrest and underlined it three times for emphasis.",
      "location": "room:train_station",
      "portable": false
    },
    "ghost_ticket": {
      "id": "ghost_ticket",
      "name": "ghost ticket",
      "aliases": ["ticket", "stub", "pass"],
      "description": "A ticket stub with no date and no price, just \"ADMIT ONE: D.N. + GUEST\" stamped in faded ink. It smells faintly of rain and printer toner.",
      "location": "room:train_station",
      "portable": true,
      "onUse": "You hold the ticket up to the flickering light. Letters rearrange to spell \"YOU'RE ALREADY ON BOARD\" before dissolving back into smudges."
    },
    "tidal_pool": {
      "id": "tidal_pool",
      "name": "tidal pool",
      "aliases": ["pool", "water", "puddle"],
      "description": "A shallow tidal pool mirrors the sky in miniature. Tiny crabs scuttle between pebbles, and a fragment of circuitry lies half-buried like an alien shell. The water tastes of salt and possibility.",
      "location": "room:coast_line",
      "portable": false
    },
    "storm_clouds": {
      "id": "storm_clouds",
      "name": "storm clouds",
      "aliases": ["clouds", "storm", "sky"],
      "description": "A bruise-coloured front gathers on the horizon. Lightning scribbles idle notes across the underside, as if sketching ideas before committing to a full performance.",
      "location": "room:coast_line",
      "portable": false
    },
    "driftwood_sign": {
      "id": "driftwood_sign",
      "name": "driftwood sign",
      "aliases": ["sign", "driftwood", "post"],
      "description": "A piece of driftwood is wedged upright between rocks. Someone carved \"BUILD LOUDLY\" into it, then crossed out LOUDLY and wrote \"TRUTHFULLY\" beneath. The wood creaks like it might offer more advice if you listen.",
      "location": "room:coast_line",
      "portable": false
    }
  },
  "npcs": {
    "friendly_stranger": {
      "id": "friendly_stranger",
      "name": "friendly stranger",
      "aliases": ["stranger", "person", "npc", "traveller"],
      "location": "room:outside",
      "description": "A person of indeterminate age leans against the storefront, jacket weatherproof and grin weathered. They watch the sky the way sailors watch the tide, amused and a little wary.",
      "dialogue": [
        "\"Lovely evening, isn't it? Well, it would be if the sky wasn't rehearsing something dramatic. Keep an eye on it, yeah?\"",
        "\"You look like someone who builds things. Creative chaos in the eyes. Respect.\"",
        "\"Storm's coming. Best pick where you want to be when it hits: safe, daring, or both.\"",
        "\"Time gets funny round here. Blink and you'll be waiting for a train that never was.\"",
        "\"That little glint near the door? If you fancy luck, don't leave it to the pigeons.\""
      ]
    }
  },
  "globals": {
    "turn": 0,
    "gameStarted": false,
    "puzzleFlags": {
      "stormWarningReceived": false,
      "exploredAllRooms": false
    }
  }
}
